# Movies Tonight Part 4: A few SELECT queries 
__Use `%%sql` magic to write the queries listed below.__

In [1]:
# load %sql magic extension
%load_ext sql

# initialize a database connection; may have to adjust username and password 
%sql sqlite:///movies.db;

'Connected: @movies.db;'

**1. Write a select query that returns the MovieTitle, TheaterName, and Showtime for each movie showing.**  
The query should use `JOIN` syntax as described in your textbook. Also, use aliases ( `… AS …` ) to make sure that column names match exactly what is asked for.

In [6]:
%%sql
SELECT MTitle AS MovieTitle, TName AS TheaterName, STime AS ShowTime
FROM MOVIES
JOIN SHOWS ON MOVIES.MID = SHOWS.MID
JOIN THEATERS ON THEATERS.TID = SHOWS.TID
LIMIT 5;

 * sqlite:///movies.db;
Done.

[('MTitle', 'Akarakian Theatres Moreno 4 Cinemas', '4:20 PM'),
 ('MTitle', 'Akarakian Theatres Moreno 4 Cinemas', '7:20 PM'),
 ('MTitle', 'Akarakian Theatres Moreno 4 Cinemas', '9:40 PM'),
 ('Associate, The', 'Akarakian Theatres Moreno 4 Cinemas', '5:10 PM'),
 ('Associate, The', 'Akarakian Theatres Moreno 4 Cinemas', '9:00 PM')]

**2. Write a select query to display the MovieTitle, TheaterName, and Showtime for each show after 7pm.** You can start with a copy of the previous query and then add a `WHERE` clause.

In [7]:
%%sql
SELECT MTitle AS MovieTitle, TName AS TheaterName, STime AS ShowTime
FROM MOVIES
JOIN SHOWS ON MOVIES.MID = SHOWS.MID
JOIN THEATERS ON THEATERS.TID = SHOWS.TID
WHERE STime > 7
LIMIT 5;

 * sqlite:///movies.db;
Done.

[('MTitle', 'Akarakian Theatres Moreno 4 Cinemas', '7:20 PM'),
 ('MTitle', 'Akarakian Theatres Moreno 4 Cinemas', '9:40 PM'),
 ('Associate, The', 'Akarakian Theatres Moreno 4 Cinemas', '9:00 PM'),
 ('Associate, The', 'Akarakian Theatres Moreno 4 Cinemas', '9:05 PM'),
 ('Ghost & The Darkness, The', 'Akarakian Theatres Moreno 4 Cinemas', '7:00 PM')]

**3. Write a select query to display the cast (actors only) of each movie.** The query should return the Movie Title, Actor Name, MID, and AID.

In [24]:
%%sql
SELECT MTitle AS MovieTitle, AName AS ActorName, MOVIES.MID, ARTISTS.AID
FROM MOVIES
JOIN CREDITS ON MOVIES.MID = CREDITS.MID
JOIN ARTISTS ON CREDITS.AID = ARTISTS.AID
WHERE CCode = "A"
LIMIT 5;

 * sqlite:///movies.db;
Done.

[('MTitle', 'Austin Pendleton', 1, 1),
 ('MTitle', 'Bebe Neuwirth', 1, 2),
 ('MTitle', 'Dianne Wiest', 1, 3),
 ('MTitle', 'Eli Wallach', 1, 4),
 ('MTitle', 'Kenny Kerr', 1, 5)]

**4. Write a select query to display the number of distinct movies that each actor appears in.** The query should return the ActorName, MovieCount, and AID. You will need to use use a GROUP BY clause and the COUNT() function.

In [34]:
%%sql
SELECT AName AS ActorName, COUNT(ARTISTS.AID) AS MovieCount, ARTISTS.AID
FROM MOVIES
JOIN CREDITS ON MOVIES.MID = CREDITS.MID
JOIN ARTISTS ON CREDITS.AID = ARTISTS.AID
WHERE CCode = "A"
GROUP BY ARTISTS.AName
ORDER BY COUNT(ARTISTS.AID) 
DESC
LIMIT 5;

 * sqlite:///movies.db;
Done.

[('Bill Murray', 2, 53),
 ('Diane Venora', 2, 100),
 ('Jada Pinkett', 2, 117),
 ('Minnie Driver', 2, 77),
 ('Vivica Fox', 2, 28)]

**5. Write a select query to display only the actors that appear in multiple movies.** The query should return the Actor Name, Movie Count, and AID. You can use the previous select query as a starting point. You will need to add a HAVING clause to do the restriction.

In [35]:
%%sql
SELECT AName AS ActorName, COUNT(ARTISTS.AID) AS MovieCount, ARTISTS.AID
FROM MOVIES
JOIN CREDITS ON MOVIES.MID = CREDITS.MID
JOIN ARTISTS ON CREDITS.AID = ARTISTS.AID
WHERE CCode = "A"
GROUP BY ARTISTS.AName
HAVING COUNT (ARTISTS.AID) > 1
ORDER BY COUNT(ARTISTS.AID) 
DESC
LIMIT 5;

 * sqlite:///movies.db;
Done.

[('Bill Murray', 2, 53),
 ('Diane Venora', 2, 100),
 ('Jada Pinkett', 2, 117),
 ('Minnie Driver', 2, 77),
 ('Vivica Fox', 2, 28)]

**6. Write a select query to display directors that also act in their movies.** The query should return the ArtistName, NumDirectorCredits, NumActorCredits, NumDirectorActorCredits. Each count should be calculated separately using a subquery. Note: NumDirectorActorCredits should be greater than 0.

In [ ]:
%%sql
SELECT AName AS ActorName, COUNT(ARTISTS.AID) AS MovieCount, ARTISTS.AID
FROM MOVIES
JOIN CREDITS ON MOVIES.MID = CREDITS.MID
JOIN ARTISTS ON CREDITS.AID = ARTISTS.AID
WHERE CCode = "A"
GROUP BY ARTISTS.AName
HAVING COUNT (ARTISTS.AID) > 1
ORDER BY COUNT(ARTISTS.AID) 
DESC
LIMIT 5;